---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.PanelScheduleData
source: html/bcd4f042-30d3-2bc8-d016-bc29dba22ac6.htm
---
# PanelScheduleData Methods

Add a Load Classification Id to the array of Load Classifications.